//Задача 10: Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает вторую цифру этого числа.
// 456 -> 5
// 782 -> 8
// 918 -> 1
Console.Clear();
Console.Write("Введите целое трехзначное число: ");
int n = Convert.ToInt32(Console.ReadLine());
n = n/10;
n = n%10;
Console.Write($"Вторая цифра введеного числа равна: {n} ");
